code-review/NRB_3471_3546/База_Стало/Catalogs/РегламентныеЗаданияПоОбъектам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>РегламентныеЗаданияПоОбъектам</Name>
			<Comment>EPAM</Comment>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>РегламентАктивен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РегламентУИД</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РегламентАвтор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РегламентИзменивший</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВызываемыйОтчетОбработка</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодичностьРасписания</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПериодичностиРасписанийРассылокОтчетов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИсполняемыйКод1С</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РеквизитыОбъекта</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РеквизитыОбъектаТабличные</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПочтовоеСообщениеТема</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>256</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПочтовоеСообщениеТипТекста</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипТекстаПочтовогоСообщения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПочтовоеСообщенияТекст</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПочтовоеСообщенияФорматированныйТекст</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПочтовоеСообщениеУведомитьОДоставке</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПочтовоеСообщениеУведомитьОПрочтении</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПочтовоеСообщениеВажность</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВажностьПочтовогоСообщения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПочтовоеСообщениеКатегории</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>256</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Уведомлять</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НастройкаОтправки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НастройкиОбменаДанными</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтчетФормат</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ФорматыСохраненияОтчетов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КластерСерверов</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИнформационнаяБаза</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

code-review/NRB_3471_3546/База_Стало/Catalogs/РегламентныеЗаданияПоОбъектам/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Функция ПредставлениеЗаданияПоРассылке()
	Возврат "Регламентное задание по объекту ("+Наименование+")"+?(ВызываемыйОтчетОбработка	= "<!!!НЕ ОПРЕДЕЛЕН!!!>", "", " - "+ВызываемыйОтчетОбработка);
КонецФункции // ()
	 
Процедура ПередЗаписью(Отказ)
	// Вызывается непосредственно до записи объекта в базу данных
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если ЭтоГруппа Тогда
		Возврат;
	КонецЕсли;
	// Проверка на заполненность данных сервера / базы
	Если Не ЗначениеЗаполнено(КластерСерверов) ИЛИ Не ЗначениеЗаполнено(ИнформационнаяБаза) Тогда
		ОбщегоНазначения.СообщитьОбОшибке("Не заполнены данные кластера серверов или базы!!!", Отказ);
		Возврат;
	КонецЕсли;	
	// Создание регламентное задание (получение уникального идентификатора)
	УстановитьПривилегированныйРежим(Истина);
	//---
	Задание = РегламентныеЗадания.НайтиПоУникальномуИдентификатору(РегламентУИД);
	Если Задание = Неопределено И РегламентАктивен Тогда
		Задание = РегламентныеЗадания.СоздатьРегламентноеЗадание(Метаданные.РегламентныеЗадания.РегламентныеЗаданияПоОбъектам);
		Задание.Использование	= РегламентАктивен;
		Задание.Наименование	= ПредставлениеЗаданияПоРассылке();
		Задание.Расписание		= ДополнительныеСвойства.Расписание;
		Задание.Записать();
		
	 	РегламентУИД = Задание.УникальныйИдентификатор;
	КонецЕсли;
	//---
	Если Не Задание = Неопределено Тогда
		Если ПометкаУдаления или Не РегламентАктивен Тогда
			Задание.Удалить();
		Иначе
			ЗаданиеИзменено = Ложь;
			// Установим признак активности регл. задания
			Если Задание.Использование <> РегламентАктивен Тогда
				Задание.Использование	= РегламентАктивен;
				ЗаданиеИзменено			= Истина;
			КонецЕсли;
			// Расписание устанавливается в форме элемента
			Если ДополнительныеСвойства.Свойство("Расписание") И ТипЗнч(ДополнительныеСвойства.Расписание) = Тип("РасписаниеРегламентногоЗадания") И Строка(ДополнительныеСвойства.Расписание) <> Строка(Задание.Расписание) Тогда
				Задание.Расписание		= ДополнительныеСвойства.Расписание;
				ЗаданиеИзменено			= Истина;
			КонецЕсли;
			// Сформируем представление задания
			НаименованиеЗадания = ПредставлениеЗаданияПоРассылке();
			Если Задание.Наименование <> НаименованиеЗадания Тогда
				Задание.Наименование	= НаименованиеЗадания;
				ЗаданиеИзменено			= Истина;
			КонецЕсли;
			// Заполним параметры задания
			Если Задание.Параметры.Количество() <> 1 ИЛИ Задание.Параметры[0] <> Ссылка Тогда
				ПараметрыЗадания = Новый Массив;
				ПараметрыЗадания.Добавить(Ссылка);
				Задание.Параметры	= ПараметрыЗадания;
				ЗаданиеИзменено		= Истина;
			КонецЕсли;
			// Если задание поменялось, то запишем
			Если ЗаданиеИзменено Тогда
				Задание.Записать();
			КонецЕсли; 
		КонецЕсли;
	КонецЕсли;
	//---
	УстановитьПривилегированныйРежим(Ложь);
КонецПроцедуры

Процедура ПередУдалением(Отказ)
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	Если ЭтоГруппа Тогда
		Возврат;
	КонецЕсли;
	
	Задание = РегламентныеЗадания.НайтиПоУникальномуИдентификатору(РегламентУИД);
	Если Задание <> Неопределено Тогда
		Задание.Удалить();
	КонецЕсли;
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	Если ЭтоГруппа Тогда
		Возврат;
	КонецЕсли;
	
	РегламентноеЗадание = Неопределено;
	РегламентУИД		= Новый УникальныйИдентификатор;
КонецПроцедуры

#КонецЕсли
